Arithmetic operation

In [3]:
import pandas as pd

In [5]:
var = pd.DataFrame({"A":[1,2,3,4,5],"B":[4,5,6,7,8]})

In [7]:
var

   A  B
0  1  4
1  2  5
2  3  6
3  4  7
4  5  8

In [9]:
var["C"] = var["A"]+var["B"]

In [11]:
var

   A  B   C
0  1  4   5
1  2  5   7
2  3  6   9
3  4  7  11
4  5  8  13

In [13]:
var["C"] = var["A"]-var["B"]

In [15]:
var

   A  B  C
0  1  4 -3
1  2  5 -3
2  3  6 -3
3  4  7 -3
4  5  8 -3

In [17]:
var["C"] = var["A"]*var["B"]
var

   A  B   C
0  1  4   4
1  2  5  10
2  3  6  18
3  4  7  28
4  5  8  40

In [19]:
var["C"] = var["A"]/var["B"]
var

   A  B         C
0  1  4  0.250000
1  2  5  0.400000
2  3  6  0.500000
3  4  7  0.571429
4  5  8  0.625000

In [41]:
var1 = pd.DataFrame({"A":[22,34,67,86,43],"B":[34,24,5,6,86]})
var1["FaultA"] = var1["A"] < 40
var1["FaultB"] = var1["B"] > 50
var1

    A   B  FaultA  FaultB
0  22  34    True   False
1  34  24    True   False
2  67   5   False   False
3  86   6   False   False
4  43  86   False    True

NameError: name 'Var1' is not defined